{
  "articles": [
    {
      "_id": "tjmyz31tf5_mxgr5gusdd",
      "title": "How to Get the Current Page URL in Gatsby",
      "author": " Dmitry Mayorov",
      "content": "This seemingly simple task had me scratching my head for a few hours while I was working on my website. As it turns out, getting the current page URL in Gatsby is not as straightforward as you may think, but also not so complicated to understand.\n\nLet’s look at a few methods of making it happen. But first, you might be wondering why on earth we’d even want to do something like this.\n\n\n#Why you might need the current URL\nSo before we get into the how, let’s first answer the bigger question: Why would you want to get the URL of the current page? I can offer a few use cases.\n\nMeta tags\nThe first obvious thing that you’d want the current URL for is meta tags in the document head:\n\n<link rel=\"canonical\" href={url} />\n<meta property=\"og:url\" content={url} />\nSocial Sharing\nI’ve seen it on multiple websites where a link to the current page is displayed next to sharing buttons. Something like this (found on Creative Market)"
    },
    {
      "_id": "lv7f2bpq6d_r5hf0dtsc3",
      "title": "Raw GraphQL Querying",
      "author": "Chris Coyier ",
      "content": "GraphQL has all kinds of awesome tooling built around it. But like everything on the web, it ultimately comes down to data shootin' across the ol' network and responses coming back. If you need to talk to a GraphQL API endpoint, you don't absolutely have to use some kind of framework or library to make requests against it. As a matter of fact, you can do it pretty cleanly in vanilla JavaScript.… Read article"
    },
    {
      "_id": "rm5iwlynpt_7j3qx2snqj",
      "title": "Create a Static Site Using Angular & Scully",
      "author": "Sarah Drasner",
      "content": "The team at HeroDevs has just released the alpha version of Scully, a static site generator for Angular. That's right, Angular didn't have an intuitive way to create JAMstack applications before, but now it's possible!\n\nScully uses a node CLI application to run Angular schematics so you don’t have to learn any new language or syntax. You can see your static files in a new dist folder called static alongside your application folder.\n\nTo watch the full setup, Tara …"
    },
    {
      "_id": "chcnd0x0d4_md9dglvo4y",
      "title": "Print-Inspired Layout on the Web",
      "author": "Chris Coyier ",
      "content": "I always love seeing people get inspired by print design and trying to port it over to the web. There is a much deeper history of interesting print work to draw from, and still a ton of modern work happening that eclipses most digital design work today. The web is fully capable of bold, interesting designs, yet we see it all-too-rarely.\n\nJust lately, we've seen a little surge of interest...… Read article"
    },
    {
      "_id": "11v4aq8j5y_alvoyxfy56",
      "title": "The Making of a “Special Series” on a WordPress Site",
      "author": "Chris Coyier ",
      "content": "We just ran a fancy article series here on CSS-Tricks with a bunch of different articles all answering the same question. By fancy, I mean two things:\n\nThe articles had a specially-designed template just for them. (Example)\nThe series has a specially-designed landing page.\nOne of the reasons I enjoy working with WordPress is because of how easy this is to pull off. I'm sure any CMS has their own ways of doing this, and I don't … Read article"
    },
    {
      "_id": "3jhg7q6a60_m2b1meg3st",
      "title": "css.gg",
      "author": "Chris Coyier",
      "content": "I'm not sure what to call these icons from Astrit Malsija. The title is \"500+ CSS Icons, Customizable, Retina Ready & API\" and the URL is \"css.gg\" but they aren't really named anything.\n\nAnyway, their shtick is:\n\nThe 🌎's first icon library designed by code.\n\nThe idea is that they don't use clip-path, they aren't icon fonts, they aren't even SVG. They are just <i> tags essentially using the shapes of CSS and pseudo elements as necessary to draw …"
    },
    {
      "_id": "qy8e29ht12_oj7b42rusu",
      "title": "The JAMstack Landscape",
      "author": "Fake Author",
      "content": "t's no big secret that Netlify invented the term JAMstack. While it's possible to embrace the JAMstack without using Netlify, it's notable that Netlify is at the very heart of the whole \"JAMstack landscape.\"\n\nWhat does \"JAMstack landscape\" even mean? I like the term because it sets the stage that JAMstack isn't just this one thing, but a way of building sites by piecing together a bunch of different ideas, the most important of which is static file hosting. "
    }
  ]
}